tap "homebrew/bundle"
tap "homebrew/services"
tap "powershell/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# Command-line fuzzy finder written in Go
brew "fzf"
# OpenType text shaping engine
brew "harfbuzz"
# Simple terminal UI for git commands
brew "lazygit"
# Open source relational database management system
brew "mysql", restart_service: true
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@17"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Keyboard customiser
cask "karabiner-elements"
# Rust-based terminal
cask "warp"
vscode "harryhopkinson.vim-theme"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "phplasma.csv-to-table"
